{
  "experience": [
    {
        "id": "1",
        "companyName": "Noroff School of Technology and Digital Media",
        "skillsDemonstrated": ["1", "4", "10", "5", "6"],
        "achievement": "Responsible for content development, teaching, and student management while overseeing project coordination and delivery. Developed learning materials and guided students through practical coursework and projects, ensuring alignment with vocational and academic standards.",
        "startDate": "April, 2022",
        "endDate": "",
        "links": {
            "companyUrl": "https://www.noroff.no/en/"
        },
        "location": "Norway (Remote)",
        "role": "Frontend Online Teacher"
    },
    {
        "id": "2",
        "companyName": "The Weather Company (an IBM Business)",
        "skillsDemonstrated": ["1", "4", "9", "5"],
        "achievement": "Worked as a Frontend Developer. Developed and optimized multiple UI components while enhancing the overall user experience of web applications. Contributed to localization efforts by adding support for multiple locales. Occasionally assisted in maintaining an existing Angular application. Collaborated using various tools and technologies, including Jenkins, Redis, Docker, Jira, and JFrog Artifactory.",
        "startDate": "June, 2022",
        "endDate": "Jan, 2024",
        "links": {
            "companyUrl": "https://weather.com/en-NG/weather/today/l/NIXX0022:1:NI?Goto=Redirected"
        },
        "location": "New York, United State",
        "role": "Frontend Engineer"
    },
    {
        "id": "3",
        "companyName": "Snaps Media Inc(Now Quiq)",
        "skillsDemonstrated": ["1", "4", "9", "5"],
        "achievement": "Built edit tag functionality into the CMS. Collaborated with a team member to build web actions functionality which increases the flexibility and efficiency of snaps bot. Resolved some parities between users and journey properties and transcript properties which causes confusion among users who expected no difference between the properties. Built multi-select functionality for the bot UI",
        "startDate": "July, 2019",
        "endDate": "Aug, 2021",
        "links": {
            "companyUrl": "www.app.snaps.io"
        },
        "location": "New York, United State",
        "role": "Fullstack Software Engineer"
    },
    {
        "id": "4",
        "companyName": "Hands-on Institute of Information Technology",
        "skillsDemonstrated": ["10", "6"],
        "achievement": "I successfully trained at least eight cohorts of students in software development and IT-related disciplines. During my time at HiiT PLC, I designed and developed study guides for key software development courses such as HTML, CSS, C#, and ASP.NET. I also created a structured front-end development curriculum that covered HTML, CSS, and ASP.NET for beginner to intermediate learners. In addition, I contributed to several key organizational decisions that enhanced curriculum delivery and improved overall student engagement.",
        "startDate": "April, 2014",
        "endDate": "Sept, 2017",
        "links": {
            "companyUrl": ""
        },
        "location": "Kano, Nigeria",
        "role": "Resource Person/Teacher"
    }
  ]
}